## Plan Result (prod_global)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 3 to add, 6 to change, 3 to destroy.</code></pre>

* Update
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain.custom_domain[&#34;fact-redirect&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain.custom_domain[&#34;idam-web-public&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain.custom_domain[&#34;jui-redirect&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_firewall_policy.custom[&#34;hwf-pet&#34;]
  * module.premium_front_door.azurerm_dns_txt_record.public_dns_record[&#34;div-pfe&#34;]
  * module.premium_front_door.azurerm_monitor_diagnostic_setting.diagnostics_access_logs_sa[0]
* Replace
  * module.premium_front_door.azurerm_cdn_frontdoor_secret.certificate[&#34;fact-redirect&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_secret.certificate[&#34;idam-web-public&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_secret.certificate[&#34;jui-redirect&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.premium_front_door.azurerm_cdn_frontdoor_custom_domain.custom_domain["fact-redirect"] will be updated in-place
  ~ resource "azurerm_cdn_frontdoor_custom_domain" "custom_domain" {
        id                       = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/hmcts-prod/customDomains/fact-redirect"
        name                     = "fact-redirect"
        # (3 unchanged attributes hidden)

      ~ tls {
          ~ cdn_frontdoor_secret_id = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/hmcts-prod/secrets/factredirect-managed-secret" -> (known after apply)
            # (2 unchanged attributes hidden)
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_custom_domain.custom_domain["idam-web-public"] will be updated in-place
  ~ resource "azurerm_cdn_frontdoor_custom_domain" "custom_domain" {
        id                       = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/hmcts-prod/customDomains/idam-web-public"
        name                     = "idam-web-public"
        # (3 unchanged attributes hidden)

      ~ tls {
          ~ cdn_frontdoor_secret_id = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/hmcts-prod/secrets/idamwebpublic-managed-secret" -> (known after apply)
            # (2 unchanged attributes hidden)
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_custom_domain.custom_domain["jui-redirect"] will be updated in-place
  ~ resource "azurerm_cdn_frontdoor_custom_domain" "custom_domain" {
        id                       = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/hmcts-prod/customDomains/jui-redirect"
        name                     = "jui-redirect"
        # (3 unchanged attributes hidden)

      ~ tls {
          ~ cdn_frontdoor_secret_id = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/hmcts-prod/secrets/juiredirect-managed-secret" -> (known after apply)
            # (2 unchanged attributes hidden)
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_firewall_policy.custom["hwf-pet"] will be updated in-place
  ~ resource "azurerm_cdn_frontdoor_firewall_policy" "custom" {
        id                                = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/hwfpetprodPremium"
        name                              = "hwfpetprodPremium"
        tags                              = {
            "application"  = "core"
            "builtFrom"    = "hmcts/azure-platform-terraform"
            "businessArea" = "CFT"
            "criticality"  = "High"
            "environment"  = "production"
            "startupMode"  = "always"
        }
        # (6 unchanged attributes hidden)

      ~ managed_rule {
            # (3 unchanged attributes hidden)

          + exclusion {
              + match_variable = "RequestBodyPostArgNames"
              + operator       = "Equals"
              + selector       = "commit"
            }

            # (9 unchanged blocks hidden)
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_secret.certificate["fact-redirect"] must be replaced
-/+ resource "azurerm_cdn_frontdoor_secret" "certificate" {
      + cdn_frontdoor_profile_name = (known after apply)
      ~ id                         = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/hmcts-prod/secrets/factredirect-managed-secret" -> (known after apply)
        name                       = "factredirect-managed-secret"
        # (1 unchanged attribute hidden)

      ~ secret {
          ~ customer_certificate {
              ~ key_vault_certificate_id  = "https://acmedcdcftappsprod.vault.azure.net/certificates/courttribunalfinder-service-gov-uk/f433ceffeaaa4a43a89e3ec7fcae055e" -> "https://acmedcdcftappsprod.vault.azure.net/certificates/courttribunalfinder-service-gov-uk/a3ce2faa04b94e2f8ed516754118e602" # forces replacement
              ~ subject_alternative_names = [
                  - "courttribunalfinder.service.gov.uk",
                  - "www.courttribunalfinder.service.gov.uk",
                ] -> (known after apply)
            }
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_secret.certificate["idam-web-public"] must be replaced
-/+ resource "azurerm_cdn_frontdoor_secret" "certificate" {
      + cdn_frontdoor_profile_name = (known after apply)
      ~ id                         = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/hmcts-prod/secrets/idamwebpublic-managed-secret" -> (known after apply)
        name                       = "idamwebpublic-managed-secret"
        # (1 unchanged attribute hidden)

      ~ secret {
          ~ customer_certificate {
              ~ key_vault_certificate_id  = "https://acmedcdcftappsprod.vault.azure.net/certificates/hmcts-access-service-gov-uk/f4d8c10d107e40fea99bb8a0ba8088f6" -> "https://acmedcdcftappsprod.vault.azure.net/certificates/hmcts-access-service-gov-uk/c25b95a04a85497f8ed43ac324aabd84" # forces replacement
              ~ subject_alternative_names = [
                  - "hmcts-access.service.gov.uk",
                  - "idam-web-public.platform.hmcts.net",
                  - "idam.platform.hmcts.net",
                  - "www.idam.platform.hmcts.net",
                ] -> (known after apply)
            }
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_secret.certificate["jui-redirect"] must be replaced
-/+ resource "azurerm_cdn_frontdoor_secret" "certificate" {
      + cdn_frontdoor_profile_name = (known after apply)
      ~ id                         = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/hmcts-prod/secrets/juiredirect-managed-secret" -> (known after apply)
        name                       = "juiredirect-managed-secret"
        # (1 unchanged attribute hidden)

      ~ secret {
          ~ customer_certificate {
              ~ key_vault_certificate_id  = "https://acmedcdcftappsprod.vault.azure.net/certificates/jcm-judiciary-uk/cb6dd553b92140aabf2d6baadb4a3735" -> "https://acmedcdcftappsprod.vault.azure.net/certificates/jcm-judiciary-uk/96ba7d92c67b459dab727e5fe142326e" # forces replacement
              ~ subject_alternative_names = [
                  - "jcm.judiciary.uk",
                  - "www.jcm.judiciary.uk",
                ] -> (known after apply)
            }
        }
    }

  # module.premium_front_door.azurerm_dns_txt_record.public_dns_record["div-pfe"] will be updated in-place
  ~ resource "azurerm_dns_txt_record" "public_dns_record" {
        id                  = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformmgmtrg/providers/Microsoft.Network/dnsZones/apply-divorce.service.gov.uk/TXT/_dnsauth.www"
        name                = "_dnsauth.www"
        tags                = {}
        # (4 unchanged attributes hidden)

      - record {
          - value = "5bz95ky3c27gb6475yz0yx2x1g4wg6qc" -> null
        }
      + record {
          + value = "validated"
        }
    }

  # module.premium_front_door.azurerm_monitor_diagnostic_setting.diagnostics_access_logs_sa[0] will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "diagnostics_access_logs_sa" {
        id                 = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/hmcts-prod|fd-log-analytics-logs-sa"
        name               = "fd-log-analytics-logs-sa"
        # (2 unchanged attributes hidden)

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

        # (4 unchanged blocks hidden)
    }

Plan: 3 to add, 6 to change, 3 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":1888,"Program":"tfcmt","SHA1":"","Target":"prod_global","Vars":{}} -->